BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega328PB.PIC
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="INT1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X03" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y11" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X04" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y12" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0"/>
      <edc:VirtualPin edc:name="AC" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X08" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y16" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X09" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y17" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="P7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X05" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y13" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X06" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X07" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="CLK0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y18" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y19" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y22" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y23" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="ADC6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y06" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AREF"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3"/>
      <edc:VirtualPin edc:name="ADC7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y07" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="ADC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y00" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="ADC1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y01" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="ADC2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y02" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="ADC3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y03" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4"/>
      <edc:VirtualPin edc:name="ADC4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y04" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="ADC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y05" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT14" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X00" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y08" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X01" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y09" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="INT0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X02" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y10" edc:ppsfunction="default"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>